{
  "profile": {
    "name": {
      "firstName": "Vyncent",
      "lastName": "Jones",
      "nickName": "Vyncent"
    },
    "title": "Software Engineer",
    "contact": {
      "email": "vynware@gmail.com",
      "github": "https://github.com/vyntendo64",
      "linkedIn": "https://bit.ly/3vctPQk",
      "city": "Santa Monica, CA"
    },
    "aboutMe": [
      "7 years of experience in making scalable, secure, database-driven componentized web applications and internal tooling both with a team and as an individual.",
      "Excellent leadership skills and keen at meeting strict deadlines.",
      "Quick learner who isn't afraid to get their hands dirty on legacy projects and will will put in the extra work to meet the highest quality standards."
    ],
    "skills": {
      "languages": [
        "Typescript",
        "PHP",
        "Python"
      ],
      "database": [
        "MySQL",
        "PostgreSQL"
      ],
      "technologies": [
        "React",
        "Node",
        "React Native",
        "GraphQL",
        "Apollo",
        "Prisma",
        "Larvel",
        "Serverless",
        "AWS Lambda",
        "Jamstack",
        "Gatsby",
        "Sequelize",
        "Netlify",
        "Webpack",
        "Docker",
        "Twilio",
        "Git",
        "Mailchimp",
        "Coldfusion"
      ],
      "hobbies": [
        "Gaming",
        "Music",
        "Cooking",
        "NBA basketball",
        "Trading cards"
      ]
    }
  },
  "contractExperience": [{
    "id": 0,
    "title": "Software Engineer",
    "location": "Canberra, AUS",
    "url": "https://www.jescoasbestos.com.au/",
    "company": "Jesco Asbestos",
    "duration": {
      "start": "03/2015",
      "end": "Current"
    },
    "accomplishments": [
      "Developed all internal tooling which is approved by the Australian government for handling the workflow needed to safely assess and remove asbestos with over 3,000 completed projects and counting.",
      "Developed internal tooling TDD for full e2e test coverage using CypressJs so important onsite workflows go uninterrupted. Latest browser and device support and built using Typescript using Apollo with GQL for fast development all hosted via Netlify for no cost.",
      "Developed Typescript GQL endpoint which Prisma ORM for CRUD operations with data stored in a secure RDS instance, served using a Serverless Lambda all for no cost and allowing for a quick development cycle.",
      "Developed a public-facing website using GatsbyJS for blazing fast load times with a Lighthouse audit score of 95+ in all categories; complete with full SEO and Google Analytics.",
      "Helped Jesco receive a government contract to oversee the demolition of the loose-fill asbestos-insulated houses for years in Canberra, ACT with this software."
    ]
  },
  {
    "id": 2,
    "title": "Software Engineer",
    "location": "Downtown Los Angeles, CA",
    "url": "https://tubescience.com/",
    "company": "Tubescience",
    "duration": {
      "start": "10/2019",
      "end": "07/2020"
    },
    "accomplishments": [
      "Built internal web application (built with React, Typescript, and GraphQL) from the ground up that was pivotal in empowering Creative Strategists to find and replicate top-performing ads.",
      "Added e2e testing suites with full coverage to all core applications run during CI/CD pipelines effectively eliminating production outages and speeding up development",
      "Developed internal web application for helping teams find and interate on high performing ads."
    ]
  }, {
    "id": 1,
    "title": "Software Engineer",
    "location": "Canberra, AUS",
    "company": "AAC Environmental",
    "duration": {
      "start": "06/2014",
      "end": "07/2015"
    },
    "accomplishments": [
      "Developed asbestos laboratory software used to score asbestos samples and track those that contained asbestos and those that did not.",
      "Sped up asbestos sample analysis workflow to the point of making AAC the #1 asbestos analysis lab in Canberra at the time and led to the company’s eventual buyout."
    ]
  }],
  "workExperience": [
    {
      "id": 0,
      "title": "Software Engineer",
      "location": "West Hollywood, CA",
      "url": "https://wagwalking.com/app",
      "company": "Wag!",
      "duration": {
        "start": "01/2018",
        "end": "05/2019"
      },
      "accomplishments": [
        "Developed numerous features and integrations with 3rd party companies to expand the companies reach and capabilities.",
        "Led the company-wide rollover to Zendesk for customer service issue tracking and ticket creation with a tested, rich feature set of back-end services and custom integrations.",
        "Led and developed theweb application's migration from in house payment system to Stripe.",
        "Developed the Google autentication portal for all employees accessing production internal tooling.",
        "Migrated legacy client web application from AngularJs to ReactJs with an animated signup flow as the crown jewel dramatically improving conversion and customer aquesition.",
        "Led the charge for the client applications to adopt typesafe practices using Flow to avoid production downtime with .",
        "Created e2e testing suite with full coverage run during CI/CD pipeline effectively eliminating production outages and speeding up development.",
        "Developed numerous features for both website and web application that needed to handle millions of hits per month."
      ]
    },
    {
      "id": 1,
      "title": "Applications Engineer",
      "location": "Sandy, UT",
      "company": "Canyons School District",
      "url": "https://www.canyonsdistrict.org/",
      "duration": {
        "start": "03/2017",
        "end": "09/2017"
      },
      "accomplishments": [
        "Led the charge to bring the entire District into the world of modular components and away from server-side templates in an no longer maintained language.",
        "Developed custom ORM and query builder layer on top of Coldfusion for faster development cycles.",
        "Launched major projects in record time that include a district-wide mileage tracking software, inventory warehouse request/distribution software, special needs enrollment program and a district-wide volunteer signup and event management system."
      ]
    }
  ],
  "projects": [{
    "id": 0,
    "title": "Stock trading bot",
    "duration": {
      "start": "07/2020",
      "end": "Current"
    },
    "accomplishments": [
      "Developed a NodeJS stock bot that watches up to 300 stock tickers at once and uses information streamed in via websockets to determine trade entry and exit points.",
      "Build a Selenium tool to scrape various websites to get volatile stocks and then integrates with Polygon.io to aggregate data. The data is then run through using various technical analysis and risk management strategies to determine trade entries in real-time.",
      "Engineered a fully robust set of backtesting scripts are used to determine strategy expected performance as well as create equity curves that can be displayed in chart format in the browser."
    ]
  },
  {
    "id": 1,
    "title": "Zoodit App",
    "url": "https://appadvice.com/app/zoodit/1326547740",
    "duration": {
      "start": "10/2017",
      "end": "11/2018"
    },
    "accomplishments": [
      "Developed a map based Reddit style application in React Native that was approved and made available on the Apple App Store.",
      "Engineered unique way using users' viewport to query for posts in those bounds sorted by upvotes as they scroll."
    ]
  }, {
    "id": 2,
    "title": "Drivyn",
    "url": "https://drivyn.net/home",
    "duration": {
      "start": "10/2016",
      "end": "Current"
    },
    "accomplishments": [
      "Developed High school driver’s education management software used to track student progress toward obtaining their license and used to help over 5,000+ students obtain their driver's license.",
      "Helped students sign up for available drives and instructors in the car mark their attendance and the hours are automatically calculated."
    ]
  },   {
    "id": 3,
    "title": "WoW Classic Dungeon Signup bot",
    "url": "https://dblstatistics.com/bot/672884081616486445",
    "duration": {
      "start": "03/2020",
      "end": "03/2021"
    },
    "accomplishments": [
      "Developed a NodeJS Discord bot was invited into over 1000 servers and earned the \"Verified Bot\" badge.",
      "Developed an easier way for players of World of Warcraft Classic to easily manage groups for a scheduled and time.",
      "Managed a Discord server that communicated features to the over 12,000 users and saw over 100,000 signups at the end of it's life."
    ]
  }],
  "educations": [{
    "school": "University of Utah",
    "duration": "2008 - 2011",
    "location": "Salt Lake City, UT",
    "degree": "BS, Economics"
  }],
  "funHighlights": [{
      "text": "5 year Division 1 NCAA Scholarship athlete for the University of Utah football program and member of the team's Leadership Council.",
      "url": "https://archive.sltrib.com/article.php?id=57185438&itype=CMSID"
    },
    {
      "text": "Successful WoW guild leader in charge of gathering and leading 40 man groups through challenging encounters bi-weekly for up to 3 hours at a time for over 2 years."
    }
  ]
}
